app/controllers/domains_controller.rb

INSERT INTO "domains" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-05-23 17:20:29.372965"], ["name", "ckn.li"], ["updated_at", "2014-05-23 17:20:29.372965"]]
---
  def create
    @domain = Domain.new(domain_params)
    if @domain.save

SELECT  "domains".* FROM "domains"  WHERE "domains"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @domain = Domain.find(params[:id])

SELECT  "domains".* FROM "domains"  WHERE "domains"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "domains" SET "name" = ?, "updated_at" = ? WHERE "domains"."id" = 2  [["name", "freibrief.netdfg"], ["updated_at", "2014-05-23 17:58:48.193794"]]
---
  def update
    @domain = Domain.find(params[:id])
    if @domain.update(domain_params)

SELECT `domains`.* FROM `domains`
---
  def index
    @domains = Domain.all

SELECT  "domains".* FROM "domains"  WHERE "domains"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "domains" WHERE "domains"."id" = ?  [["id", 2]]
---
  def destroy
    @domain = Domain.find(params[:id])
    @domain.destroy