app/controllers/redirections_controller.rb

  def new
    redirect_to new_domain_path, notice: "create a domain first" if Domain.all.empty?
---
SELECT COUNT(*) FROM `domains`
SELECT `domains`.* FROM `domains`

  def create
    @redirection = Redirection.new(redirection_params)
    if @redirection.save
---
INSERT INTO `redirections` (`created_at`, `destination`, `domain_id`, `source`, `updated_at`) VALUES ('2014-05-25 13:48:36', 'ulf@test.de', 1, 'alles', '2014-05-25 13:48:36')

  def edit
    @redirection = Redirection.find(params[:id])
    @domains = Domain.all
---
SELECT  `redirections`.* FROM `redirections`  WHERE `redirections`.`id` = 1 LIMIT 1
SELECT `domains`.* FROM `domains`

  def update
    @redirection = Redirection.find(params[:id])
    if @redirection.update(redirection_params)
---
SELECT  `redirections`.* FROM `redirections`  WHERE `redirections`.`id` = 1 LIMIT 1
UPDATE `redirections` SET `destination` = 'i@ckn.li', `updated_at` = '2014-05-25 14:08:00' WHERE `redirections`.`id` = 1

  def index
    @redirections = Redirection.all
---
SELECT `redirections`.* FROM `redirections`