app/controllers/users_controller.rb

  def new
    redirect_to new_domain_path, notice: "create a domain first" if Domain.all.empty?
---
SELECT COUNT(*) FROM `domains`
SELECT `domains`.* FROM `domains`

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-23 19:09:31.255300"], ["email", "i@ckn.li"], ["password", "sdadads"], ["updated_at", "2014-05-23 19:09:31.255300"]]

  def edit
    @user = User.find(params[:id])
    @domains = Domain.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT `domains`.* FROM `domains`

  def update
    @user = User.find(params[:id])

    @user.user = user_params[:user]
    @user.domain_id = user_params[:domain_id]
    @user.password = user_params[:password] if user_params[:change_pw] == "1"
    #render text: user_params.inspect
    if @user.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "domain_id" = ?, "updated_at" = ?, "user" = ? WHERE "users"."id" = 4  [["domain_id", 3], ["updated_at", "2014-05-25 12:10:03.806364"], ["user", "ckn"]]